[
	{  
   		"course_id": 11111,
   		"lesson_id": 111,
   		"para_data":"<h3>What is HTML?</h3><h6>HTML stands for HyperText Markup Language</h6><h6>HTML is not a programming language, it's a markup language, which describes the structure of web pages.</h6>Throughout the structure of all web pages consist HTML elements. HTML elements are individual components of web pages which act as the basic building blocks of HTML.</h6><br> <br> <h6>HTML Elements:</h6> HTML elements are constructed using  a opening tag, and ending tag, and content between the two tags. Here is an example of how HTML elements are constructed alongside an example of a constructed HTML element below: <br><br><img src='https://www.oreilly.com/library/view/learning-web-design/9781449337513/httpatomoreillycomsourceoreillyimages2257977.png' height='' width='420'><br><p>HTML elements are defined by the value of the opening tag. So entering h1 as the value of the opening tag will display large heading content. While entering p, will display standard paragraph content.<br><h5>Task:<h5><h6>The text editor adjacent to this matieral allows you to enter HTML and have it rendered on screen in the third column! Following the structure displayed above: <ul><li> Create a HTML element using h1 as the value in the opening tag, Please enter your name as the content between the opening and closing tag, then run the code!</li></ul></h6></li>In order to display content on web pages, the content must be placed between the opening and closing tag of the HTML element. <br> <p>However, when creating HTML elements you must remember the closing tag of the HTML element! If you forget to the closing tag of one HTML element, then following elements may render the same value as the unclosed HTML element. <br> Using the Text Editor, Try this for yourself, Remove the closing tag from the HTML element you created. Now create a second HTML element underneath. The value of the opening and closing tags should be p! Between the tags please enter your name again! Now, run the code to see how it affects the web page! <br>As you can see the second HTML element renders the same value as the first HTML element because of the unclosed tag.<h5>Task:</h5><h6><ul><li>Add the Closing Tag to the first element you created, and run the code again to check the output!</li></ul></h6><br><h4>Empty HTML Elements</h4><p>Most HTML elements with no content between the opening and closing tag will display no content, however there are some HTML elements which can be implemented in web pages with no content. One of these elements is called br. The br element creates line breaks on the web page.</p> Try this for yourself, Between the two HTML elements you have created, create three HTML elements with br as the value. Run the code and look how the output changes!<br><br><h4>Are HTML elements case sensitive?</h4><p>It should also be noted that HTML elements are not case sensitive, however it is considered good practice to keep HTML lowercase.</p><p><br><br><br> "
		,"answer":"<h1> </h1>",	
		"answer2":"<p> </p>",		
		"feedback":"Well Done! You have created your first HTML element",
		"feedback2": "Provided you have applied the correct closing tags. You can see the p tag renders normal text!",
		"incorrect_feedback":"Task 1 Feedback: Did you follow the Element structure Correctly?",
		"incorrect_feedback2":"Task 2 Feedback : Did you remember to apply the closing tag?"
	},
	{
                "course_id": 11111,
                "lesson_id": 112,
		"para_data":"<p>In the previous lesson, HTML elements were introducted. Incase you cannot remember how they are structured. Here is an example:</p> <img src='https://mdn.mozillademos.org/files/9347/grumpy-cat-small.png' height='' width='420'><br><br><p>However HTML elements are only part of the overall structure of HTML webpages.</p> <H3>HTML Page Structure</h3><p>Every HTML Web Page follows the same structure. </p><img src='http://help.madcapsoftware.com/flare2017r2/Content/Resources/Images/Flare/page_structure_example.png' height='205' width='350'><br> <br><h4>What do these elements do?</h4><br> <h4>html:</h3><p>The html element is the root element of a HTML web page</p></h4><h4>head: </h4><p> The head element is used to store the meta data about the web page.</p> <p>This meta data can include something simple like the document title.</p> <p>However other types of meta data include style, which can change the style of HTML elements. This can change the colour or size of elements.</p> <p>Another is script. Script elements are used to apply Javascript functionality to web pages.</p> <h4>title: </h4> <p>The title element is used to specify the title of the webpage in the browser toolbar.</p> <h4>body: </h4><p>The body tag is used to display the content of a web page.</p><p> For content to be displayed on a webpage, all HTML elements, which are intended to display content, must be placed within the body. If not then content will not be displayed.</p><H4>Task:</h4 <p>Based on the content of this lesson:</p><ul><li>Use the HTML web page structure displayed above to display content.</li> <li>Using a HTML element you learnt in the previous lesson, Please create a HTML element which has the value H1, and place it within the HTML page structure</li><li>Once you have done this run the code to check the output!</li></ul><br><p>For the purposes of this learning application, HTML elements will be rendered without using the HTML page structure. However when you are developing your own web page's you must follow this structure to ensure that content is displayed.</p><h4>Headings</h4><p>H1 is not the only heading element that can be displayed using HTML.<p>Heading elements in HTML range from h1-h6, with H1 displaying the largest heading, and H6 the smallest.</p><h4>Task:</h4><ul><li>Create a second HTML element using the h2 HTML element and place it within the body!</li></ul><br><br><br><br>",
		"answer":"<html> <head> <body> <h1> </h1> </body> </head> </html>",
		"answer2":"<h2> </h2>",
		"feedback":"Well Done! You have used the correct HTML page structure!",
                "feedback2": "As you can see using h2 as the value of the HTML element creates a smaller heading!",
                "incorrect_feedback":"Task 1:Did you follow the page structure correctly?",
                "incorrect_feedback2":"Task 2: Did you remember to use H2 as the value in the opening tag?"		
	},
	{
                "course_id": 11111,
                "lesson_id": 113,
                "para_data": "<p> Welcome to lesson 3, the contents of this lesson is...</p>",
                "answer":"<h1> </h1> <h3 style='color:red;'> </h3>",
                "answer2":"<h3 style='color:red;'> </h3>",
                "feedback":"Well Done! You have used the correct HTML page structure!",
                "feedback2":"As you can see using h2 as the value of the HTML element creates a smaller heading!",
                "incorrect_feedback":"Task 1:Did you follow the page structure correctly?",
                "incorrect_feedback2":"Task 2: Did you remember to use H2 as the value in the opening tag?"
        },
	{
                "course_id": 11111,
                "lesson_id": 114,
                "para_data": "<p> Welcome to lesson 4, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3 style='color:red;'> </h3>",
                "feedback":"Feedback for Answer 1 Task 2",
                "feedback2":"Feedback for Answer 2 Task 2"
        },
	{
                "course_id": 11111,
                "lesson_id": 115,
                "para_data": "<p> Welcome to lesson 5, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>",
                "feedback":"Feedback for Answer 1 Task 2",
                "feedback2":"Feedback for Answer 2 Task 2"
        },
	{
                "course_id": 20001,
                "lesson_id": 211,
                "para_data": "<p> Welcome to lesson 1, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        },
	{
                "course_id": 20001,
                "lesson_id": 212,
                "para_data": "<p> Welcome to lesson 2, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        },
	{
                "course_id": 20001,
                "lesson_id": 213,
                "para_data": "<p> Welcome to lesson 3, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        },
	{
                "course_id": 20001,
                "lesson_id": 214,
                "para_data": "<p> Welcome to lesson 4, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        },
	{
                "course_id": 20001,
                "lesson_id": 215,
                "para_data": "<p> Welcome to lesson 5, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        },
	{
                "course_id": 30001,
                "lesson_id": 311,
                "para_data": "<p> Welcome to lesson 1, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        },
	{
                "course_id": 30001,
                "lesson_id": 312,
                "para_data": "<p> Welcome to lesson 2, the contents of this lesson is...</p>",
                "answer":"<script> </script>",
                "answer2":"<h3> </h3>"
        }


	

]
